-- MySQL dump 10.13  Distrib 8.0.28, for macos11 (x86_64)
--
-- Host: localhost    Database: nodedb
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `staging_xr`
--

DROP TABLE IF EXISTS `staging_xr`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `staging_xr` (
  `startAt` year DEFAULT NULL,
  `code` int NOT NULL,
  `schoolName` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `staging_xr`
--

LOCK TABLES `staging_xr` WRITE;
/*!40000 ALTER TABLE `staging_xr` DISABLE KEYS */;
INSERT INTO `staging_xr` VALUES (0000,166,'湖南省湘西州凤凰县三拱桥乡乡音欣欣小学','欣慧教学/欣智阅读/欣悦成长','1台打印机4台教师电脑；3个班级图书角；校园围墙1项改善及文体器材支持\r'),(2019,166,'湖南省湘西州凤凰县三拱桥乡乡音欣欣小学','欣悦成长','60套学生课桌椅\r'),(2020,166,'湖南省湘西州凤凰县三拱桥乡乡音欣欣小学','欣智阅读','为3个班级图书角各增补70册左右图书\r'),(2018,44,'湖南省湘西州凤凰县禾库镇广恩欣欣小学','欣慧教学/欣智阅读/欣悦成长','1台打印机1台教师电脑；4个班级图书角；校园修复翻新1项改善及文体器材支持\r'),(2020,44,'湖南省湘西州凤凰县禾库镇广恩欣欣小学','欣智阅读','为4个班级图书角各增补70册左右图书\r'),(2018,104,'湖南省湘西州凤凰县禾库镇以琳欣欣小学','欣慧教学/欣智阅读/欣悦成长','1台打印机1台教师电脑；4个班级图书角；校园修复翻新1项改善及文体器材支持\r'),(2020,104,'湖南省湘西州凤凰县禾库镇以琳欣欣小学','欣智阅读','为4个班级图书角各增补70册左右图书\r'),(2018,191,'湖南湘西州凤凰县落潮井乡唐家桥片思谕欣欣完小','欣慧教学/欣智阅读/欣悦成长','1台打印机2台教师电脑；7个班级图书角；食堂坪坝硬化、蓄水池修建、厕所维修3项改善及文体器材支持\r'),(2019,191,'湖南湘西州凤凰县落潮井乡唐家桥片思谕欣欣完小','欣悦成长','支持开展暑期乡村夏令营活动服务120余名学童\r'),(2020,191,'湖南湘西州凤凰县落潮井乡唐家桥片思谕欣欣完小','欣智阅读/欣悦成长','为7个班级图书角各增补70册左右图书；800只医用口罩\r'),(2018,213,'湖南湘西州凤凰县官庄乡溪口梁继焜欣欣完小','欣慧教学/欣智阅读/欣悦成长','1台打印机3台教师电脑；9个班级图书角；学校线路改造1项改善及文体器材支持\r'),(2020,213,'湖南湘西州凤凰县官庄乡溪口梁继焜欣欣完小','欣智阅读','为9个班级图书角各增补70册左右图书\r'),(2018,254,'湖南湘西州龙山县召市镇欣欣中心小学','欣慧教学/欣智阅读/欣悦成长','1台打印机3台教师电脑；7个书柜；教室粉刷1项改善及文体器材支持\r'),(2020,254,'湖南湘西州龙山县召市镇欣欣中心小学','欣悦成长','500只医用口罩\r'),(2018,24,'南湘西花垣县花垣镇思谕欣欣小学','欣慧教学/欣智阅读/欣悦成长','1台打印机2台教师电脑；6个班级图书角；文体器材支持\r'),(2020,24,'南湘西花垣县花垣镇思谕欣欣小学','欣智阅读/欣悦成长','为6个班级图书角各增补70册左右图书；300只医用口罩\r'),(2018,266,'贵州省铜仁市桐木坪乡卜口欣欣中心小学','欣慧教学','1台打印机\r'),(2018,35,'四川省南充市西充县同德乡欣欣小学','欣慧教学','1台打印机\r'),(2018,322,'陕西省咸阳市乾县城关街道办张家堡朱保真欣欣完小','欣慧教学/欣智阅读','1台打印机；6个书柜1套图书支持\r'),(2018,20,'湖北省潜江市熊口镇万德固李蕴华伉俪纪念小学','欣慧教学','1台打印机\r'),(2018,32,'湖南省平江县三墩乡振华小学','欣慧教学/欣悦成长','1台打印机；1套文体设施支持\r'),(2018,251,'安徽省固镇县任桥镇姚毓霖欣欣小学','欣慧教学','1台打印机\r'),(2018,74,'江苏省宝应县芦村乡中心小学居秉溶欣欣教学楼','欣慧教学','1台打印机；电脑室升级维护支持项目\r'),(2018,122,'内蒙古赤峰市翁牛特旗山咀子乡炎亮欣欣小学','欣慧教学','1台打印机；电脑室升级维护支持项目\r'),(2018,206,'广西壮族自治区容县松山镇欣欣小学','欣悦成长','1套文体设施\r'),(2018,208,'四川省达州市通川区金石镇林氏欣欣中心学校','欣悦成长','1套文体设施\r'),(2018,203,'陕西省旬阳县桂花乡九零学社欣欣九年制学校','欣悦成长','1套文体设施\r'),(2020,203,'陕西省旬阳县桂花乡九零学社欣欣九年制学校','欣悦成长','学生宿舍空调9台\r'),(2018,146,'湖北省钟祥双河镇丁坪村李济博士伉俪纪念欣欣小学','欣慧教学/欣悦成长','5台教师电脑；1套文体设施\r'),(2018,48,'湖南省长沙县白沙乡杨隆佑二小','欣智阅读/欣悦成长','6个书柜1套图书支持；1套文体设施支持\r'),(2018,22,'云南省泸西县旧城镇旧龙寨广恩欣欣小学','欣慧教学/欣悦成长','2台教师电脑支持；1套文体设施支持\r'),(2018,218,'湖北省阳新县兴国镇思源欣欣小学','欣智阅读/欣悦成长','7个书柜1套图书支持；1套文体设施支持\r'),(2018,263,'山西省五台县陈家庒乡环椿坪慧海欣欣小学','欣悦成长','1套文体设施支持\r'),(2018,181,'岳阳市平江县长寿镇新民欣欣完小','欣慧教学','1台教师电脑\r'),(2018,300,'陕西省渭南市澄城县王庄镇耀扬欣欣小学','欣智阅读','6个书柜1套图书支持\r'),(2018,63,'青海省西宁市湟中县土门关乡业隆达人欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,224,'重庆市万州区长滩镇瑞生欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,161,'黑龙江伊春市西林区欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,12,'黑龙江省望奎县恭六欣欣希望小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,70,'宁夏海原县关庄乡北岔荣恩欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,331,'陕西省兴平市东城街道办事处东关小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,326,'陕西省汉中市洋县龙亭镇创立克欣欣中心小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,230,'湖南永州市江华瑶族自治州白芒营镇李绍姒欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,182,'湖南省湘潭市湘乡县月山镇栗山乡许德期欣欣学校','欣慧教学','电脑室升级维护支持项目\r'),(2018,29,'辽宁省丹东市振安区同兴镇宋氏欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,116,'辽宁省葫芦岛连山区台集屯镇常玉章纪念欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,95,'吉林白城通榆县向海乡高氏欣欣中心小学','欣慧教学','电脑室升级维护支持项目\r'),(2021,95,'吉林白城通榆县向海乡高氏欣欣中心小学','欣智阅读','2名老师参与2021阅读培训\r'),(2018,222,'吉林省辽源矿务局实验文祥欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,290,'河南省驻马店市驿城区板桥镇贝克欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,167,'河南省周口市淮阳县府君庙乡音欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,136,'甘肃省敦煌市七里镇国任欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2021,136,'甘肃省敦煌市七里镇国任欣欣小学','欣智阅读','6个班级图书角\r'),(2018,279,'贵州省安顺市西秀区黄腊亲晖欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,307,'湖北省十堰市郧县杨溪铺镇晋山琳峰欣欣完全小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,273,'湖北汉川汈汊湖水科所方李邦琴欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2021,273,'湖北汉川汈汊湖水科所方李邦琴欣欣小学','欣智阅读','1名老师参与2021阅读培训\r'),(2018,247,'山西晋城市陵川县六泉乡六泉欣欣中心小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,298,'四川叙州区双龙镇金山村林氏欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2018,292,'四川省巴中市南江县高塔镇金盆硅谷女性欣欣小学','欣慧教学','电脑室升级维护支持项目\r'),(2019,292,'四川省巴中市南江县高塔镇金盆硅谷女性欣欣小学','欣慧教学/小额示范项目/乡土项目','1台打印机；乡土课程经费、活动物资支持；参与2019蒲江乡土培训\r'),(2021,292,'四川省巴中市南江县高塔镇金盆硅谷女性欣欣小学','欣慧教学/乡土项目/欣悦成长/欣智阅读','\"1间信息技术教室改善；2名老师参与2021乡土研讨会；夏令营项目因疫情延迟'),(2018,45,'湖南省常德市汉寿县军山铺镇中学欣欣永嘉综合楼','欣慧教学','10台教师电脑\r'),(2018,78,'湖南省汉寿县军山铺镇欣欣小学','欣慧教学','1台教师电脑\r'),(2018,309,'湖南省株洲市茶陵县舲舫乡中心小学','欣悦成长','塑胶跑道1项校园改善\r'),(2018,106,'湖南省常德市鼎城区逆江坪乡杨隆祜欣欣小学','欣悦成长','1项校园改善\r'),(2018,1,'黑龙江省哈尔滨市双城区朝阳乡中心学校欣欣小学','欣悦成长','1套文体设施\r'),(2019,1,'黑龙江省哈尔滨市双城区朝阳乡中心学校欣欣小学','欣智阅读/乡土项目','\"3套班级图书；乡土课程用具'),(2021,1,'黑龙江省哈尔滨市双城区朝阳乡中心学校欣欣小学','乡土项目','4名老师参与2021乡土研讨会\r'),(2019,302,'湖南省湘西吉首市矮寨镇克让欣欣小学','欣慧教学/欣悦成长','1台教师电脑;1名老师参与广元校长培训；文体器材1套\r'),(2020,302,'湖南省湘西吉首市矮寨镇克让欣欣小学','欣智阅读','3个班级图书角\r'),(2019,102,'湖南省湘西古丈县草潭乡龙飞欣欣小学','欣慧教学/欣悦成长','1台打印机；学生宿舍上下床改善\r'),(2020,102,'湖南省湘西古丈县草潭乡龙飞欣欣小学','欣悦成长','300只医用口罩\r'),(2019,54,'湖南省湘西芦溪县上堡乡梁继焜纪念学校','欣慧教学/欣悦成长','1台打印机；校园文化宣传栏改善\r'),(2020,54,'湖南省湘西芦溪县上堡乡梁继焜纪念学校','欣悦成长','\"300只医用口罩'),(2019,97,'湖南省湘西龙山县石羔镇飞鹏欣欣小学','欣慧教学/欣智阅读/欣悦成长','4台教师电脑及1台打印机；11个班级图书角；文体器材113件\r'),(2020,97,'湖南省湘西龙山县石羔镇飞鹏欣欣小学','欣智阅读/欣悦成长','为11个班级图书角各增补70册左右图书；65套课桌椅\r'),(2019,214,'湖南湘西龙山县水沙坪乡信望爱欣欣中心小学','欣慧教学/欣悦成长','4台教师电脑；文体器材120件\r'),(2020,214,'湖南湘西龙山县水沙坪乡信望爱欣欣中心小学','欣慧教学/欣智阅读','1台A4打印机1台A3打印机；1间阅览室改善\r'),(2019,98,'湖南省湘西永顺县青坪镇广恩欣欣小学','欣悦成长','6套乒乓球台\r'),(2020,98,'湖南省湘西永顺县青坪镇广恩欣欣小学','欣智阅读/欣悦成长','13个班级图书角；1000只医用口罩\r'),(2019,100,'湖南省湘西吉首市双塘镇仲浩欣欣小学','欣慧教学','4台教师电脑1台打印机\r'),(2020,100,'湖南省湘西吉首市双塘镇仲浩欣欣小学','欣智阅读/欣悦成长','6个班级图书角；50套课桌椅\r'),(2019,82,'湖南省湘西吉首市马颈坳镇育民欣欣小学','欣慧教学/欣悦成长','1台打印机；文体器材8件;组织10余名学童与老师参与北京秋令营\r'),(2020,82,'湖南省湘西吉首市马颈坳镇育民欣欣小学','欣智阅读/欣悦成长','7个班级图书角；7套体育器材包\r'),(2021,82,'湖南省湘西吉首市马颈坳镇育民欣欣小学','欣悦成长/乡土项目','2021夏令营项目因疫情延迟，物资到校；1名老师参与2021乡土研讨会\r'),(2019,111,'四川遂宁市射洪县官升镇林氏欣欣小学','欣悦成长','课桌椅50套\r'),(2020,111,'四川遂宁市射洪县官升镇林氏欣欣小学','欣慧教学/欣智阅读','9个班级图书角；1间信息技术教室改善\r'),(2019,150,'河南省巩义市芝田镇怡安欣欣中心小学','欣智阅读','1间阅览室改善\r'),(2020,150,'河南省巩义市芝田镇怡安欣欣中心小学','欣智阅读','15个班级图书角\r'),(2021,150,'河南省巩义市芝田镇怡安欣欣中心小学','欣悦成长','2021夏令营项目因疫情延迟，物资到校\r'),(2019,311,'山东省曲阜市王庄乡高雨辰欣欣小学','欣慧教学','1台A3打印机\r'),(2020,311,'山东省曲阜市王庄乡高雨辰欣欣小学','小额示范项目/欣悦成长','小额示范项目转为班级图书角项目，共计9个班级图书角支持；校园水井建设1项改善\r'),(2021,311,'山东省曲阜市王庄乡高雨辰欣欣小学','欣智阅读','2名老师参与2021阅读培训\r'),(2019,156,'山东省烟台市张格庒乡牟焕经欣欣完全小学','欣慧教学/小额示范项目/乡土项目','1台A3彩色打印机；小额示范项目支持学校书柜；参与2019蒲江乡土培训\r'),(2019,269,'陕西省榆林市靖边县阳光林韬欣欣完全小学','小额示范项目/乡土项目','小额示范项目支持学校阅读图书，乡土活动物资及实验器材；参与2019蒲江乡土培训\r'),(2021,269,'陕西省榆林市靖边县阳光林韬欣欣完全小学','欣智阅读','2名老师参与2021阅读培训\r'),(2019,328,'安徽省肥西县铭传乡李国彝欣欣小学    ','小额示范项目/乡土项目','小额示范项目支持学校阅读书柜及阅览室改善；参与2019蒲江乡土培训\r'),(2021,328,'安徽省肥西县铭传乡李国彝欣欣小学    ','欣智阅读','2名老师参与2021乡土研讨会\r'),(2019,330,'江西省宜丰县棠浦镇塘岭凯文欣欣小学','乡土项目','参与2019蒲江乡土培训\r'),(2021,330,'江西省宜丰县棠浦镇塘岭凯文欣欣小学','欣智阅读','2名老师参与2021阅读培训\r'),(2019,59,'甘肃省玉门市柳河乡蘑菇滩庆华欣欣小学','乡土项目','参与2019蒲江乡土培训\r'),(2021,59,'甘肃省玉门市柳河乡蘑菇滩庆华欣欣小学','欣智阅读','12个班级图书角\r'),(2020,195,'湖南湘西吉首市社塘坡禧福欣欣学校','欣智阅读/欣悦成长','\"1000只医用口罩'),(2021,195,'湖南湘西吉首市社塘坡禧福欣欣学校','欣慧教学/欣智阅读','2名老师参与2021阅读培训，支持下辖坪云村小1个图书角；支持下辖坪云村小1台教师电脑\r'),(2020,196,'湖南省湘西吉首市丹青乃新欣欣中学','欣悦成长','500只医用口罩\r'),(2020,303,'湖南省湘西吉首市白岩乡真光欣欣中心完小','欣悦成长','500只医用口罩\r'),(2020,51,'湖南省湘西花垣县龙潭镇广恩欣欣小学','欣慧教学/欣智阅读/欣悦成长','\"1台教师电脑；3个班级图书角；300只医用口罩'),(2020,96,'湖南省湘西花垣县长乐乡以琳欣欣小学','欣智阅读','2个班级图书角\r'),(2021,96,'湖南省湘西花垣县长乐乡以琳欣欣小学','欣悦成长','学生校服支持\r'),(2020,228,'湖南湘西花垣县民乐镇仲浩欣欣中心小学','欣慧教学/欣智阅读/欣悦成长','26个班级图书角；2000个医用口罩；1间信息技术教室改善\r'),(2021,228,'湖南湘西花垣县民乐镇仲浩欣欣中心小学','欣智阅读','3名老师参与2021阅读培训\r'),(2020,194,'湖南湘西永顺县泽家乃新欣欣九年制学校','欣智阅读/欣悦成长','2000只医用口罩；10个班级图书角\r'),(2020,205,'陕西省商洛市柞水县杏坪镇欣欣中心校','欣悦成长','学生宿舍上下床50张\r'),(2020,11,'黑龙江省绥化市太平川镇欣欣小学','欣悦成长','学生营养餐项目第一年度\r'),(2021,11,'黑龙江省绥化市太平川镇欣欣小学','欣悦成长','学生营养餐项目第二年度\r'),(2021,140,'宁夏固原市原州区甘城乡乔畔以琳欣欣小学','欣智阅读','4个班级图书角\r'),(2021,141,'宁夏固原市原州区甘城乡石景以琳欣欣小学','欣智阅读','4个班级图书角\r'),(2021,27,'吉林省白城市通榆县开通镇明德欣欣小学','欣智阅读','1名老师参与2021阅读培训\r'),(2021,201,'陕西省延安市洛川县交口河镇林行规欣欣中心小学','欣智阅读','1名老师参与2021阅读培训\r'),(2021,320,'陕西省岐山县雍川镇麦禾营欣欣示范中心小学','欣智阅读','1名老师参与2021阅读培训');
/*!40000 ALTER TABLE `staging_xr` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-02-11 14:02:59
